var transportMenu = Array("#bboss地图","#b练级传送","#b城镇传送","#b活动地图","#b组队任务");
var sels = Array(Array(
Array(100000005,0,"铁甲猪公园"),
Array(105070002,0,"蘑菇王之墓"),
Array(105090900,0,"被诅咒的寺院"),
Array(240020402,0,"喷火龙栖息地"),
Array(240020101,0,"格瑞芬多森林"),
Array(701010323,0,"大王蜈蚣"),
Array(741020100,0,"黑轮王"),
Array(230040420,0,"皮亚奴斯洞穴"),
Array(220080000,0,"时间塔的本源"),
Array(211042300,0,"扎昆入口"),
Array(240050400,0,"暗黑龙王洞穴") ,
Array(105100100,0,"寺院地下"),
Array(541020800,0,"克雷塞尔遗迹") ,
Array(702060000,0,"少林妖僧") ,
Array(551030100,0,"心疤狮王和暴力熊") ,
Array(501030104,0,"拉瓦那")  ,
Array(270050000,0,"忘却的黄昏")  ,
Array(800040410,0,"蛤蟆BOSS")

),
Array(
Array(104040000,0,"适合 1 ~ 15 级玩家。"),
Array(103000101,0,"适合 20 ~ 30 级玩家。"),
Array(103000105,0,"适合 50 ~ 70 级玩家。"),
Array(101030110,0,"适合 40 ~ 60 级玩家。"),
Array(106000002,0,"适合 40 ~ 60 级玩家。"),
Array(101030103,0,"适合 40 ~ 60 级玩家。"),
Array(101040001,0,"适合 20 ~ 35 级玩家。"),
Array(101040003,0,"适合 20 ~ 35 级玩家。"),
Array(101030001,0,"适合 20 ~ 35 级玩家。"),
Array(104010001,0,"适合 10 ~ 20 级玩家。"),
Array(105070001,0,"适合 20 ~ 40 级玩家。"),
Array(105090300,0,"适合 40 ~ 70 级玩家。"),
Array(105040306,0,"适合 60 ~ 80 级玩家。"),
Array(230020000,0,"适合 30 ~ 40 级玩家。"),
Array(230010400,0,"适合 40 ~ 50 级玩家。"),
Array(211041400,0,"适合 55 ~ 70 级玩家。"),
Array(222010000,0,"适合 20 ~ 50 级玩家。"),
Array(220010500,0,"适合 40 ~ 70 级玩家。"),
Array(251010000,0,"适合 45 ~ 60 级玩家。"),
Array(250020000,0,"适合 50 ~ 60 级玩家。"),
Array(800020130,0,"适合 50 ~ 70 级玩家。"),
Array(200040000,0,"适合 35 ~ 60 级玩家。"),
Array(541010010,0,"适合 60 ~ 90 级玩家。"),
Array(200010301,0,"适合 70 ~ 90 级玩家。"),
Array(600020300,0,"适合 80 ~ 120 级玩家。"),
Array(240020100,0,"适合 85 ~ 120 级玩家。"),
Array(220070201,0,"适合 85 ~ 120 级玩家。"),
Array(220070301,0,"适合 95 ~ 120 级玩家。"),
Array(240040000,0,"适合 95 ~ 120 级玩家。"),
Array(551030100,0,"适合 95 ~ 120 级玩家。"),
Array(541020000,0,"适合 95 ~ 150 级玩家。"),
Array(240040500,0,"适合 100 ~ 150 级玩家。")
),
Array(
//Array(910000000,0,"自由市场"),
//Array(701000210,0,"大擂台"),
Array(1000000,0,"彩虹岛新手村"),
Array(104000000,0,"明珠港"),
Array(100000000,0,"射手村"),
Array(101000000,0,"魔法密林"),
Array(102000000,0,"勇士部落"),
Array(103000000,0,"废弃都市"),
Array(120000000,0,"诺特勒斯号码头"),
Array(105040300,0,"林中之城"),
Array(103040000,0,"废都广场"),
Array(140000000,0,"里恩"),
Array(106020000,0,"蘑菇城"),
Array(110000000,0,"黄金海岸"),
Array(200000000,0,"天空之城"),
Array(211000000,0,"冰峰雪域"),
Array(230000000,0,"水下世界"),
Array(222000000,0,"童话村"),
Array(220000000,0,"玩具城"),
Array(250000000,0,"武陵"),
Array(702000000,0,"少林寺"),
Array(702100000,0,"大雄宝殿"),
Array(701000000,0,"上海外滩"),
Array(500000000,0,"泰国"),
Array(501000000,0,"泰国寺庙"),
Array(260000000,0,"阿里安特"),
Array(600000000,0,"新叶城"),
Array(240000000,0,"神木村"),
Array(240070000,0,"塔拉森林"),
Array(261000000,0,"玛加提亚"),
Array(221000000,0,"地球防御本部"),
Array(251000000,0,"百草堂"),
Array(550000000,0,"吉隆大都市"),
Array(130000000,0,"圣地"),
Array(551000000,0,"甘榜村"),
Array(801000000,0,"昭和村"),
Array(541000000,0,"新加坡码头"),
Array(300000000,0,"艾林森林"),
Array(270000100,0,"时间神殿"),
Array(800000000,0,"古代神社"),
Array(800040000,0,"枫叶古城"),
Array(802000100,0,"逆奥之城"),
Array(740000000,0,"西门町"),
Array(741000000,0,"不夜城"),
Array(742000000,0,"101大道"),
Array(701000200,0,"上海豫园"),
Array(682000000,0,"闹鬼宅邸外部"),
Array(610020006,0,"绯红要塞")
//Array(741000200,0,"钓鱼场")


//Array(749020000,0,"国庆蛋糕地图")
),
Array(
Array(105040316,10,"沉睡森林跳跳"),
Array(103000900,10,"地铁三号线一号地区B1"),
Array(103000903,10,"地铁三号线二号地区B2"),
Array(103000908,10,"地铁三号线三号地区B3"),
Array(280020000,10,"火山跳跳"),
Array(101000100,10,"忍苦跳跳") ,
Array(922240200,0,"拯救嘎嘎"),
Array(922231000,0,"月妙游乐园"),
Array(980040000,0,"魔女塔"),
Array(109080000,0,"打椰子"),
Array(109080010,0,"冰地"),
Array(109040000,0,"向高地"),
Array(109040000,0,"寻宝"),
Array(109030001,0,"上楼"),
Array(109060000,0,"滚雪球"),
Array(780000000,0,"boss怪物冒险大擂台1"),
Array(780000001,0,"boss怪物冒险大擂台2"),
Array(780000002,0,"boss怪物冒险大擂台3"),
Array(780000003,0,"boss怪物冒险大擂台4"),
Array(780000004,0,"boss怪物冒险大擂台5"),
Array(780000005,0,"boss怪物冒险大擂台6"),
Array(780000006,0,"boss怪物冒险大擂台7"),
Array(781000000,0,"多数怪物大擂台1"),
Array(781000001,0,"多数怪物大擂台2"),
Array(781000002,0,"多数怪物大擂台3"),
Array(781000003,0,"多数怪物大擂台4"),
Array(782000000,0,"障碍比赛大擂台1"),
Array(782000001,0,"障碍比赛大擂台2"),
Array(782000002,0,"障碍比赛大擂台3"),
Array(749040000,0,"舞狮活动地图"),
Array(749030000,0,"旅馆内部地图"),
Array(749050000,0,"皮卡啾派對出場地圖"),
Array(749050200,0,"皮卡啾派對出場地圖"),
Array(749050400,0,"转蛋屋"),
Array(749050500,0,"外层空间钓鱼场"),
Array(749050501,0,"梦幻王国钓鱼场"),
Array(749050502,0,"精灵钓鱼场")
),

Array(
Array(100000200,0,"月妙的年糕"),
Array(103000000,0,"废弃组队"),
Array(980000000,0,"休彼德蔓怪物嘉年华1"),
Array(980030000,0,"休彼德蔓怪物嘉年华2"),
Array(200080101,0,"天空女神之塔"),
Array(221024500,0,"101玩具城"),
Array(251010404,0,"老海盗"),
Array(300030100,0,"毒雾森林"),
Array(261000011,0,"罗密欧与朱丽叶"),
Array(926010000,0,"金字塔"),
Array(980010000,0,"阿里安特竞技场"),
Array(910320000,0,"列车平台"),
Array(925020000,0,"武陵道场"),
Array(970030000,0,"强化特训场地"),
Array(101030104,0,"遗迹公会对抗\r\n"),
Array(180000000,0,"GM地图\r\n"),
		));
		var sel;
		var status;
function start() {
	/*var oldEquip = cm.getEquipInSlot(1);
	var newEquip = cm.getEquipInSlot(2);
	cm.eatEquip(cm.getPlayer(),oldEquip,newEquip);
	cm.removeItem(1,1,1);*/
    status = -1;
    sel = -1;
	var text = "想去旅行吗？ 请选择你要去的地方吧：\r\n";
	/*text += "#d角色名称：#b" + cm.getName() + "#k#n\t\t  #d剩余金币：#b" + cm.getMeso() + "#k#n\r\n";
	text += "#d点卷余额：#b" + cm.getPlayer().getCashShop().getCash(1) + "#k#n\t#d         抵用余额：#b" + cm.getPlayer().getCashShop().getCash(4) + "#k#n\r\n"	;*/
	text += generateSelectionMenu(transportMenu);
    cm.sendSimple(text);
}
function action(mode, type, selection) {
    status++;
    if (mode != 1) {
        if(mode == 0 && type != 4)
            status -= 2;
        else{
            cm.dispose();
            return;
        }
    }
    if (status == 0) {
		sel = selection;
    	var text = "请选择你要去的地方吧：\r\n";
  		for(var i=0;i<sels[sel].length;i++){
	 		text +="#L"+i+"##b#m"+sels[sel][i][0]+"##r\t\t"+sels[sel][i][2]+"#k#l\r\n"
		}
		cm.sendSimple(text);
	}else if(status ==1){
		cm.warp(sels[sel][selection][0]);
		cm.dispose();
	}
}
function generateSelectionMenu(array) {     // nice tool for generating a string for the sendSimple functionality
        var menu = "";
        for (var i = 0; i < array.length; i++) {
                menu += "#L" + i + "##r" + array[i] + "#k#l";
				if(i%4 == 3){
					menu+="\r\n";
				}else{
					menu+="\t";
				}
        }
        return menu;
}



/* Dawnveil
    Futuroid
	Gaga
    Made by Daenerys
*/
// var status = -1;
//
// function action(mode, type, selection) {
//     if (mode == 1) {
//         status++;
//     } else {
//         if (status == 0) {
// 		    cm.sendNext("真倒霉。你改变主意的时候告诉我。");
//             cm.dispose();
//         }
//         status--;
//     }
//     if (status == 0) {
// 	    cm.sendYesNo("我准备好用我的新发明来毁灭世界！你准备好做一个未来派了吗？");
// 	} else if (status == 1) {
// 	    cm.sendNext("哈哈，骗你的，活动还没有开放呢");
//         cm.dispose();
//     }
// }