package server.incubator;

public class Henesys extends incubator {

    static int[] arr = {};
    private static final int[] getCommonItems = {
            1012584, 1, 1, //音符脸部印花（蓝色）
            1012585, 1, 1, //音符脸部印花（红色）
            1012586, 1, 1, //音符脸部印花（紫色）
            1012587, 1, 1, //音符脸部印花（白色）
            1012362, 1, 1, //圣诞鹿鼻子
            1012071, 5, 1, //巧克力雪糕
            1012072, 5, 1, //甜瓜雪糕
            1012073, 5, 1, //西瓜雪糕
            1032032, 5, 1, //秋叶耳环
            1012139, 5, 1, //金达莱图标
            1012140, 5, 1, //迎春花图标
            1012141, 5, 1, //四叶草图标
            1012146, 5, 1, //玩具红鼻子
            1142207, 5, 1, //春花胸針
            1142206, 5, 1, //幸運草胸針
            1102040, 5, 1, //浪人披风(黄)
            1302105, 1, 1, //圣诞六翼天使武器(单手剑)
            1312039, 1, 1, //圣诞六翼天使武器(单手斧)
            1322065, 1, 1, //圣诞六翼天使武器(单手钝器)
            1402053, 1, 1, //圣诞六翼天使武器(双手剑)
            1412035, 1, 1, //圣诞六翼天使武器(双手斧)
            1422039, 1, 1, //圣诞六翼天使武器(双手钝器)
            1432050, 1, 1, //圣诞六翼天使武器(枪)
            1442071, 1, 1, //圣诞六翼天使武器(矛)
            1452062, 1, 1, //圣诞六翼天使武器(弓)
            1462056, 1, 1, //圣诞六翼天使武器(弩)
            1472077, 1, 1, //圣诞六翼天使武器(拳套)
            1482029, 1, 1, //圣诞六翼天使武器(指节)
            1492030, 1, 1, //圣诞六翼天使武器(手枪)
            1372035, 1, 1, //火灵珠短杖
            1372036, 1, 1, //毒灵珠短杖
            1372037, 1, 1, //冰灵珠短杖，
            1372038, 1, 1, //雷灵珠短杖
            1372035, 1, 1, //火灵珠短杖
            1372036, 1, 1, //毒灵珠短杖
            1372037, 1, 1, //冰灵珠短杖，
            1372038, 1, 1, //雷灵珠短杖
            1372040, 3, 1, //剧毒之杖
            1372041, 3, 1, //寒冰之杖
            1372042, 3, 1, //狂雷之杖
            1112746, 1, 1, //反抗者戒指
    };
    private static final int[] getUncommonItems = {
            1372046, 1, 1, //圣诞六翼天使武器(短杖)
            1372046, 1, 1, //圣诞六翼天使武器(短杖)
            1113097, 1, 1, //妖精戒指
            1382062, 1, 1, //圣诞六翼天使武器(长杖)
            1113034, 1, 1, //10周年黑色戒指
            1102043, 1, 1, //浪人披风(褐)
            1012070, 3, 1, //草莓雪糕5G5MG
            1092050, 1, 1, //冷艳剑盾
            1112746, 1, 1,//反抗者戒指
            1112746, 1, 1, //反抗者戒指
            1132022, 5, 1,
            1102042, 5, 1, //浪人披风(紫)
            1382048, 1, 1,//雷灵珠长杖
            2070019, 1, 1, //盘子镖
            1132229, 1, 1, //10周年白色腰带
            1012380, 1, 1, //口香糖
            1092049, 1, 1, //热情剑盾
            1372046, 1, 1, //圣诞六翼天使武器(短杖)
            1372046, 1, 1, //圣诞六翼天使武器(短杖)
            1113097, 1, 1, //妖精戒指
            1382062, 1, 1, //圣诞六翼天使武器(长杖)
            1113034, 1, 1, //10周年黑色戒指
            1102043, 1, 1, //浪人披风(褐)
            1012070, 3, 1, //草莓雪糕5G5MG
            1092050, 1, 1, //冷艳剑盾
            1112746, 1, 1,//反抗者戒指
            1112746, 1, 1, //反抗者戒指
            1132022, 5, 1,
            1102042, 5, 1, //浪人披风(紫)
            1382048, 1, 1,//雷灵珠长杖

            2070019, 1, 1, //盘子镖
            1132229, 1, 1, //10周年白色腰带
            1012380, 1, 1, //口香糖
            1092049, 1, 1, //热情剑盾
            1113185, 1, 1,//黑门戒指
//            1113018,1,1,//妖精争执戒指
//            1113018,1,1,//妖精争执戒指


};

private static final int[] getRareItems = {
        1122309, 1, 1, //小明的项链
        1122310, 1, 1, //小菁的项链
        1122311, 1, 1, //阿里山守护者项链
        1122299, 1, 1, //圣诞鹿吊坠
        1122309, 1, 1, //小明的项链
        1122310, 1, 1, //小菁的项链
        1122311, 1, 1, //阿里山守护者项链
        1122299, 1, 1, //圣诞鹿吊坠
        1003782, 1, 1, //神．紫烏鴉
        1003782, 1, 1, //神．戴碧斯魂
        1003782, 1, 1, //神．精靈王之頭冠
        1003782, 1, 1, //神．龍魔導士翅膀頭巾
        1102041, 3, 1, //浪人披风(粉)
        1102041, 3, 1, //浪人披风(粉)
        1102041, 3, 1, //浪人披风(粉)
        1102041, 3, 1, //浪人披风(粉)
        1102041, 3, 1, //浪人披风(粉)
        1082149, 5, 1, //工地手套
        1082149, 5, 1, //工地手套
        1082149, 5, 1, //工地手套
        1082149, 5, 1, //工地手套
        1082149, 5, 1, //工地手套
        1082149, 5, 1, //工地手套
        1082149, 5, 1, //工地手套
        1082149, 5, 1, //工地手套
        1082149, 5, 1, //工地手套

        1003843, 1, 1, //狐狸面具
        };

@Override
public int[] getCommonItems() {
        return getCommonItems;
        }

@Override
public int[] getUncommonItems() {
        return getUncommonItems;
        }

@Override
public int[] getRareItems() {
        return getRareItems;
        }

        }